RT-Thread/rt-thread/bsp/n32/n32gxx_lxx/libraries/n32_drivers/drv_pwm.c
#endif /* TIM3_PWM_CH1_PA6 */
#ifdef TIM3_PWM_CH1_PB4
            .ch[0].gpio_grp = GPIOB,
            .ch[0].pin = GPIO_PIN_4,
            .ch[0].info = "TIM3 PWMCH1 PB4",
#endif /* TIM3_PWM_CH1_PB4 */
#ifdef TIM3_PWM_CH1_PC6
            .ch[0].gpio_grp = GPIOC,
            .ch[0].pin = GPIO_PIN_6,
            .ch[0].info = "TIM3 PWMCH1 PC6",
#endif /* TIM3_PWM_CH1_PC6 */
            .ch[0].gpio_af = GPIO_AF2_TIM3,
            .ch[0].pwm_mode = TIM_OCMODE_PWM1,
#endif /* TIM3_PWM_CFG_CH1 */
#ifdef BSP_USING_TIM3_PWM_CH2
#ifdef TIM3_PWM_CH2_PA7
            .ch[1].gpio_grp = GPIOA,
            .ch[1].pin = GPIO_PIN_7,
            .ch[1].info = "TIM3 PWMCH2 PA7",
            .ch[1].gpio_af = GPIO_AF2_TIM3,
#endif /* TIM3_PWM_CH2_PA7 */
#ifdef TIM3_PWM_CH2_PB5
            .ch[1].gpio_grp = GPIOB,
            .ch[1].pin = GPIO_PIN_5,
            .ch[1].info = "TIM3 PWMCH2 PB5",
            .ch[1].gpio_af = GPIO_AF4_TIM3,
#endif /* TIM3_PWM_CH2_PB5 */
#ifdef TIM3_PWM_CH2_PC7
            .ch[1].gpio_grp = GPIOC,
            .ch[1].pin = GPIO_PIN_7,
            .ch[1].info = "TIM3 PWMCH2 PC7",
            .ch[1].gpio_af = GPIO_AF2_TIM3,
#endif /* TIM3_PWM_CH2_PC7 */
            .ch[1].pwm_mode = TIM_OCMODE_PWM1,
#endif /* TIM3_PWM_CFG_CH2 */
#ifdef BSP_USING_TIM3_PWM_CH3
#ifdef TIM3_PWM_CH3_PB0
            .ch[2].gpio_grp = GPIOB,
            .ch[2].pin = GPIO_PIN_0,
            .ch[2].info = "TIM3 PWMCH3 PB0",
#endif /* TIM3_PWM_CH3_PB0 */
#ifdef TIM3_PWM_CH3_PC8
            .ch[2].gpio_grp = GPIOC,
            .ch[2].pin = GPIO_PIN_8,
            .ch[2].info = "TIM3 PWMCH3 PC8",
#endif /* TIM3_PWM_CH3_PC8 */
            .ch[2].pwm_mode = TIM_OCMODE_PWM1,
            .ch[2].gpio_af = GPIO_AF2_TIM3,
#endif /* TIM3_PWM_CFG_CH3 */
#ifdef BSP_USING_TIM3_PWM_CH4
#ifdef TIM3_PWM_CH4_PB1
            .ch[3].gpio_grp = GPIOB,
            .ch[3].pin = GPIO_PIN_1,
            .ch[3].info = "TIM3 PWMCH4 PB1",
#endif /* TIM3_PWM_CH4_PB1 */
#ifdef TIM3_PWM_CH4_PC9
            .ch[3].gpio_grp = GPIOC,
            .ch[3].pin = GPIO_PIN_9,
            .ch[3].info = "TIM3 PWMCH4 PC9",
#endif /* TIM3_PWM_CH4_PC9 */
            .ch[3].gpio_af = GPIO_AF2_TIM3,
            .ch[3].pwm_mode = TIM_OCMODE_PWM1,
#endif /* TIM3_PWM_CFG_CH4 */
        },/**N32L406_CFG_TIM3*/
#endif /**N32L4XX*/
#endif
};
/**
 * @brief enable gpio rcc
 * 
 * @param  gpio_grp         
 */
static void n32_gpio_rcc_enable(GPIO_Module *gpio_grp)
{
    assert_param(IS_GPIO_ALL_PERIPH(gpio_grp));
    if (GPIOA == gpio_grp)
    {
        RCC_EnableAPB2PeriphClk(RCC_APB2_PERIPH_GPIOA, ENABLE);
         LOG_D("enable gpio rcc GPIOA");
    }
    else if (GPIOB == gpio_grp)
    {
        RCC_EnableAPB2PeriphClk(RCC_APB2_PERIPH_GPIOB, ENABLE);
        LOG_D("enable gpio rcc GPIOB");
    }
    else if (GPIOC == gpio_grp)
    {
        RCC_EnableAPB2PeriphClk(RCC_APB2_PERIPH_GPIOC, ENABLE);
         LOG_D("enable gpio rcc GPIOC");
    }
    else if (GPIOD == gpio_grp)
    {
        RCC_EnableAPB2PeriphClk(RCC_APB2_PERIPH_GPIOD, ENABLE);
         LOG_D("enable gpio rcc GPIOD");
    }
#if defined(SOC_N32G45X) || defined(SOC_N32WB452) || defined(SOC_N32G4FR)
    else if (GPIOE == gpio_grp)
    {
        RCC_EnableAPB2PeriphClk(RCC_APB2_PERIPH_GPIOE, ENABLE);
    }
#if defined(SOC_N32G45X) 
    else if (GPIOF == gpio_grp)
    {
        RCC_EnableAPB2PeriphClk(RCC_APB2_PERIPH_GPIOF, ENABLE);
    }
    else if (GPIOG == gpio_grp)
    {
        RCC_EnableAPB2PeriphClk(RCC_APB2_PERIPH_GPIOG, ENABLE);
    }
#endif
#endif
}
/**
 * @brief 
 * @param  gpio_grp         
 * @param  pin              
 * 
 * The pin of Timer 2 involves the debug pin of SWD-JTAG. When reusing, it is necessary to first set the reuse of jSWD-JTAG
               JTMS/SWDIO 		PA13-----------swd
               JTCK/SWCLK 		A14------------swd
               JTDI 			PA15
               JTDO 			PB3
               NJTRST 			PB4

            * GPIO_ConfigPinRemap(GPIO_RMP_SW_JTAG_SW_ENABLE,ENABLE);
 */
static  void gpio_remap_JTAGOFF_SWDON(GPIO_Module *gpio_grp, uint16_t pin)
{
#if defined(SOC_N32G45X) || defined(SOC_N32WB452) || defined(SOC_N32G4FR)
    if ((GPIOA == gpio_grp && GPIO_PIN_15==pin) ||
        (GPIOB == gpio_grp && GPIO_PIN_3==pin) ||
        (GPIOB == gpio_grp && GPIO_PIN_4==pin))
    {
        RCC_EnableAPB2PeriphClk(RCC_APB2_PERIPH_AFIO, ENABLE);
        GPIO_ConfigPinRemap(GPIO_RMP_SW_JTAG_SW_ENABLE, ENABLE);
    }
#endif
}
/**
 * @brief  enable time rcc
 */
static  void n32_time_rcc_config(TIM_Module *htim)
{
    RT_ASSERT(TIM1 == htim || TIM2 == htim || TIM3 == htim || TIM4 == htim || TIM5 == htim || TIM8 == htim
#if defined(SOC_N32G45X) || defined(SOC_N32WB452) || defined(SOC_N32G4FR)
    );
#else
              || TIM9 == htim);
#endif
    if (TIM1 == htim)
    {
        RCC_EnableAPB2PeriphClk(RCC_APB2_PERIPH_TIM1, ENABLE);
    }
    else if (TIM2 == htim)
    {
        RCC_EnableAPB1PeriphClk(RCC_APB1_PERIPH_TIM2, ENABLE);
    }
    else if (TIM3 == htim)
    {
        RCC_EnableAPB1PeriphClk(RCC_APB1_PERIPH_TIM3, ENABLE);
    }
    else if (TIM4 == htim)
    {
        RCC_EnableAPB1PeriphClk(RCC_APB1_PERIPH_TIM4, ENABLE);
    }
    else if (TIM5 == htim)
    {
        RCC_EnableAPB1PeriphClk(RCC_APB1_PERIPH_TIM5, ENABLE);
    }
    else if (TIM8 == htim)
    {
        RCC_EnableAPB2PeriphClk(RCC_APB2_PERIPH_TIM8, ENABLE);
    }
#if defined(SOC_N32L43X) || defined(SOC_N32L40X) || defined(SOC_N32G43X)
    else if (TIM9 == htim)
    {
        RCC_EnableAPB1PeriphClk(RCC_APB1_PERIPH_TIM9, ENABLE);
    }
#endif
}
 /**
  * @brief get time fre
  * 
  * @param  htim             tim handler
  * @return rt_uint32_t        time fre
  */
static rt_uint32_t tim_clock_get(TIM_Module *htim)
{
     RCC_ClocksType RCC_Clocks;
     rt_uint32_t timclk;
     rt_uint32_t cfgr;
     rt_uint32_t apb1_pre;
     rt_uint32_t apb2_pre;
     RCC_GetClocksFreqValue(&RCC_Clocks);
     /* Read APB1/APB2 prescaler configuration from RCC->CFG.
      * On this SoC, timer clock is doubled only when APB prescaler != 1.
      * APB1 prescaler bits: CFG[10:8], APB2 prescaler bits: CFG[13:11].
      * Prescaler encoding: 0..3 => HCLK not divided (prescaler = 1),
      *                     4..7 => division by 2,4,8,16 and timer clock = 2 * PCLK.
      */
     cfgr = RCC->CFG;
     apb1_pre = (cfgr >> 8) & 0x7U;
     apb2_pre = (cfgr >> 11) & 0x7U;
     if (htim == TIM1 || htim == TIM8)
     {
         timclk = RCC_Clocks.Pclk2Freq;
         if (apb2_pre >= 4U)
         {
             timclk *= 2U;
         }
     }
     else
     {
         timclk = RCC_Clocks.Pclk1Freq;
         if (apb1_pre >= 4U)
         {
             timclk *= 2U;
         }
     }
     return timclk;
 
