RT-Thread/rt-thread/bsp/n32/n32gxx_lxx/libraries/n32_drivers/drv_pwm.c
}
/**
 * @brief enable pwm channel
 * 
 * @param  pwm              pwm handler
 * @param  channel          pwm channel
 * @param  enable           pem enable
 * @return rt_err_t 
 */
static rt_err_t drv_pwm_enable(struct n32_pwm *pwm, const rt_uint32_t channel, rt_bool_t enable)
{
    TIM_Module *time = pwm->tim;
    uint16_t tim_ch;
    switch (channel)
    {
    case 0:
        tim_ch = TIM_CH_1;
        break;
    case 1:
        tim_ch = TIM_CH_2;
        break;
    case 2:
        tim_ch = TIM_CH_3;
        break;
    case 3:
        tim_ch = TIM_CH_4;
         break;
    default:
        return -RT_EINVAL;
        break;
    }
    TIM_EnableCapCmpCh(time, tim_ch, enable ? TIM_CAP_CMP_ENABLE : TIM_CAP_CMP_DISABLE);
    PWM_LOG_D("%s %d ch enable ch = %x ", __FUNCTION__, __LINE__, channel);
    return RT_EOK;
}
/**
 * @brief enable pwm complementary channel
 * 
 * @param  pwm              pwm handler
 * @param  channel          pwm channel
 * @param  enable           pem enable
 * @return rt_err_t 
 */
static rt_err_t drv_pwmn_enable(struct n32_pwm *pwm, const rt_uint16_t channel, rt_bool_t enable)
{
    /* Converts the channel number to the channel number of Hal library */
    uint16_t tim_ch;
    switch (channel)
    {
    case 0:
        tim_ch = TIM_CH_1;
        break;
    case 1:
        tim_ch = TIM_CH_2;
        break;
    case 2:
        tim_ch = TIM_CH_3;
        break;
    case 3:
        tim_ch = TIM_CH_4;
        break;
    default:
        return -RT_EINVAL;
        break;
    }
    /*enable out*/ 
    TIM_EnableCapCmpChN(pwm->tim, tim_ch, enable ? TIM_CAP_CMP_N_ENABLE : TIM_CAP_CMP_N_DISABLE);
    return RT_EOK;
}
/**
 * @brief get period and duty
 * 
 * @param  pwm              pwm handler
 * @param  configuration    pwm configuration
 * @return rt_err_t 

 */
static rt_err_t drv_pwm_get(struct n32_pwm *pwm, struct rt_pwm_configuration *configuration)
{
    TIM_Module *htim = pwm->tim;
    TIM_Module *tim = pwm->tim;
    /*get TIM CLK*/ 
    rt_uint32_t tim_clock = tim_clock_get(tim);
    /* convet ns Convert nanosecond to frequency and duty cycle. 1s = 1 * 1000 * 1000 * 1000 ns UNIT MHz*/
    tim_clock /= 1000000UL;
    /*period time*/ 
    uint32_t period = TIM_GetAutoReload(tim) + 1;
    uint32_t psc = tim->PSC + 1;
    configuration->period = period * psc * 1000UL / tim_clock;
    /*nS*/
    uint32_t cmp = 0;
    switch (configuration->channel)
    {
    case 0:
        cmp = TIM_GetCap1(htim);
        break;
    case 1:
        cmp = TIM_GetCap2(htim);
        break;
    case 2:
        cmp = TIM_GetCap3(htim);
        break;
    case 3:
        cmp = TIM_GetCap4(htim);
        break;
    default:
        return -RT_EINVAL;
        break;
    }
    configuration->pulse = (cmp + 1) * (psc) * 1000UL / tim_clock;
    PWM_LOG_D("period = %d pulse= %d ", __FUNCTION__, __LINE__, configuration->period, configuration->pulse);
    return RT_EOK;
}
/**
 * @brief set peroid
 *
 * @param  pwm
 * @param  configuration
 * @return rt_err_t
 */
static rt_err_t drv_pwm_set_period(struct n32_pwm *pwm, struct rt_pwm_configuration *configuration)
{
    rt_uint32_t period;
    rt_uint64_t tim_clock, psc;
    tim_clock = tim_clock_get(pwm->tim);
    /* Convert nanosecond to frequency and duty cycle. 1s = 1 * 1000 * 1000 * 1000 ns */
    tim_clock /= 1000000UL;
    period = (rt_uint64_t)configuration->period * tim_clock / 1000ULL;
    psc = period / MAX_PERIOD + 1;
    period = period / psc;
    /*1.set psc*/ 
    TIM_ConfigPrescaler(pwm->tim, psc - 1, TIM_PSC_RELOAD_MODE_UPDATE);

    if (period < MIN_PERIOD)
    {
        period = MIN_PERIOD;
    }
    /*2.set period*/ 
    TIM_SetAutoReload(pwm->tim, period - 1);
    PWM_LOG_D("%s %d psc=%d  period %d ", __FUNCTION__, __LINE__, psc, period);
    return RT_EOK;
}
/**
 * @brief set duty
 *
 * @param  pwm
 * @param  configuration
 * @return rt_err_t
 */
static rt_err_t drv_pwm_set_pulse(struct n32_pwm *pwm, struct rt_pwm_configuration *configuration)
{
    rt_uint32_t period, pulse;
    rt_uint32_t tim_clock;
    /* Converts the channel number to the channel number of Hal library */
    TIM_Module *tim = pwm->tim;

    rt_uint32_t auto_reload = TIM_GetAutoReload(tim) + 1;
    tim_clock = tim_clock_get(tim);
    tim_clock /= 1000000UL;
    /*caculate  period*/ 
    period = auto_reload * (TIM_GetPrescaler(tim) + 1) * 1000UL / tim_clock;
    pulse = (rt_uint64_t)configuration->pulse * auto_reload / period;
    /* To determine user input, output high level is required */
    if (configuration->pulse >= period)
    {
        /* 100% or above duty: keep output high over the whole period */
        pulse = auto_reload;
    }
    else if (pulse < MIN_PULSE)
    {
        pulse = MIN_PULSE;
    }
    PWM_LOG_D("pulse = %d", pulse);
    /*set cmp value*/ 
    switch (configuration->channel)
    {
    case 0:
        TIM_SetCmp1(tim, pulse);
        break;
    case 1:
        TIM_SetCmp2(tim, pulse);
        break;
    case 2:
        TIM_SetCmp3(tim, pulse);
        break;
    case 3:
        TIM_SetCmp4(tim, pulse);
        break;
    default:
       return -RT_EINVAL;
        break;
    }
    TIM_SetCnt(tim, 0);
    TIM_GenerateEvent(tim, TIM_EVT_SRC_UPDATE);
    return RT_EOK;
}
static rt_err_t drv_pwm_set(struct n32_pwm *pwm, struct rt_pwm_configuration *configuration)
{
    rt_uint32_t period, pulse;
    rt_uint32_t tim_clock, psc;
    /* Converts the channel number to the channel number of Hal library */
    TIM_Module *tim = pwm->tim;
    tim_clock = tim_clock_get(tim);
    tim_clock /= 1000000;
    PWM_LOG_D("TIME CLK = %dMHz,PWM fre = %dHz", tim_clock, 1000 * 1000 * 1000 / configuration->period);
    period = (rt_uint64_t)configuration->period * tim_clock / 1000ULL;
    /*get psc*/ 
    psc = period / MAX_PERIOD + 1;
    /*get period*/ 
    period = period / psc;
    /*1.set psc*/ 
    TIM_ConfigPrescaler(tim, psc - 1, TIM_PSC_RELOAD_MODE_UPDATE);
    if (period < MIN_PERIOD)
    {
        period = MIN_PERIOD;
    }
    TIM_SetAutoReload(tim, period - 1);
    /*PWM_LOG_D("TIME period %d", period);*/ 
    pulse = (rt_uint64_t)configuration->pulse * tim_clock / psc / 1000ULL;
    if (pulse < MIN_PULSE)
    {
        pulse = MIN_PULSE;
    }
    /*To determine user input, output high level is required*/
    else if (pulse >= period)
    {
        pulse = period;
    }
    PWM_LOG_D("TIME ch %d = pulse %d psc=%d period=%d", configuration->channel, pulse, psc, period);
    switch (configuration->channel)
    {
    case 0:
        TIM_SetCmp1(tim, pulse);
        break;
    case 1:
        TIM_SetCmp2(tim, pulse);
        break;
    case 2:
        TIM_SetCmp3(tim, pulse);
        break;
    case 3:
        TIM_SetCmp4(tim, pulse);
        break;
    default:
        return -RT_EINVAL;
        break;
    }
    TIM_SetCnt(tim, 0);
    TIM_GenerateEvent(tim, TIM_EVT_SRC_UPDATE);
    return RT_EOK;
}
/**
 * @brief pwm control
 * 
 * @param  device            pwm device
 * @param  cmd              commond
 * @param  arg              argment
 * @return rt_err_t 
 */
static rt_err_t drv_pwm_control(struct rt_device_pwm *device, int cmd, void *arg)
{
    struct rt_pwm_configuration *configuration = (struct rt_pwm_configuration *)arg;
    struct n32_pwm *pwm = (struct n32_pwm *)device->parent.user_data;
    switch (cmd)
    {
    case PWM_CMD_ENABLE:
        if (configuration->complementary)
        {
            return drv_pwmn_enable(pwm, configuration->channel, RT_TRUE);
        }
        else
        {
            return drv_pwm_enable(pwm, configuration->channel, RT_TRUE);
        }
     case PWM_CMD_DISABLE:
         if (configuration->complementary)
         {
             return drv_pwmn_enable(pwm, configuration->channel, RT_FALSE);
         }
         else
         {
             return drv_pwm_enable(pwm, configuration->channel, RT_FALSE);
         }
    case PWM_CMD_SET:
        return drv_pwm_set(pwm, configuration);
    case PWM_CMD_SET_PERIOD:
        return drv_pwm_set_period(pwm, configuration);
    case PWM_CMD_SET_PULSE:
        return drv_pwm_set_pulse(pwm, configuration);
    case PWM_CMD_GET:
        return drv_pwm_get(pwm, configuration);
    default:
        return -RT_EINVAL;
    }
}
/**
 * @brief pwm gpio config
 * 
 * @param  chanel           pwm  channel
 */
static void drv_pwm_time_gpio_config(struct n32_pwm_channel *chanel)

{
    PWM_LOG_D("%s %d config %s is ok", __FUNCTION__, __LINE__, chanel->info);
    GPIO_InitType GPIO_InitStructure;

#if defined(SOC_N32G45X) || defined(SOC_N32WB452) || defined(SOC_N32G4FR)

